In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("student_performance_2.csv")

In [3]:
print(df.isnull().sum())

Student ID             0
Gender                 0
Age                    0
School                 0
Math Score           358
Reading Score        345
Writing Score        337
Class Performance      0
dtype: int64

In [4]:
df.shape

(7000, 8)

In [5]:
df.describe()

        Student ID          Age   Math Score  Reading Score  Writing Score
count  7000.000000  7000.000000  6642.000000    6655.000000    6663.000000
mean   3500.500000    19.006286    80.463264      80.598648      80.293862
std    2020.870275     1.411874    13.153499      12.973563      12.746946
min       1.000000    17.000000    60.000000      60.000000      60.000000
25%    1750.750000    18.000000    70.000000      70.000000      70.000000
50%    3500.500000    19.000000    80.000000      80.000000      80.000000
75%    5250.250000    20.000000    91.000000      91.000000      90.000000
max    7000.000000    21.000000   150.000000     150.000000     149.000000

In [6]:
df.dtypes

Student ID             int64
Gender                object
Age                    int64
School                object
Math Score           float64
Reading Score        float64
Writing Score        float64
Class Performance     object
dtype: object

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Student ID         7000 non-null   int64
 1   Gender             7000 non-null   object
 2   Age                7000 non-null   int64
 3   School             7000 non-null   object
 4   Math Score         6642 non-null   float64
 5   Reading Score      6655 non-null   float64
 6   Writing Score      6663 non-null   float64
 7   Class Performance  7000 non-null   object
dtypes: float64(3), int64(2), object(3)
memory usage: 437.6+ KB

In [8]:
df['Age']=df['Age'].astype('float')

In [11]:
df.dtypes

Student ID             int64
Gender                object
Age                  float64
School                object
Math Score           float64
Reading Score        float64
Writing Score        float64
Class Performance     object
dtype: object

In [12]:
df.describe()

        Student ID          Age   Math Score  Reading Score  Writing Score
count  7000.000000  7000.000000  6642.000000    6655.000000    6663.000000
mean   3500.500000    19.006286    80.463264      80.598648      80.293862
std    2020.870275     1.411874    13.153499      12.973563      12.746946
min       1.000000    17.000000    60.000000      60.000000      60.000000
25%    1750.750000    18.000000    70.000000      70.000000      70.000000
50%    3500.500000    19.000000    80.000000      80.000000      80.000000
75%    5250.250000    20.000000    91.000000      91.000000      90.000000
max    7000.000000    21.000000   150.000000     150.000000     149.000000

In [13]:
df.count()

Student ID           7000
Gender               7000
Age                  7000
School               7000
Math Score           6642
Reading Score        6655
Writing Score        6663
Class Performance    7000
dtype: int64

In [15]:
df['Age'].value_counts()

Age
18.0    1455
21.0    1425
19.0    1397
20.0    1365
17.0    1358
Name: count, dtype: int64

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Student ID         7000 non-null   int64
 1   Gender             7000 non-null   object
 2   Age                7000 non-null   float64
 3   School             7000 non-null   object
 4   Math Score         6642 non-null   float64
 5   Reading Score      6655 non-null   float64
 6   Writing Score      6663 non-null   float64
 7   Class Performance  7000 non-null   object
dtypes: float64(4), int64(1), object(3)
memory usage: 437.6+ KB

In [17]:
# Function to normalize 'Age' column
def min_max_normalize_age(df):
    df['Age'] = (df['Age'] - df['Age'].min()) / (df['Age'].max() - df['Age'].min())

In [18]:
# Function to convert 'Gender' column to numeric values
def convert_gender_to_numeric(df):
    df['Gender'] = df['Gender'].map({'Male': 0, 'Female': 1})

In [19]:
df.describe()

        Student ID          Age   Math Score  Reading Score  Writing Score
count  7000.000000  7000.000000  6642.000000    6655.000000    6663.000000
mean   3500.500000    19.006286    80.463264      80.598648      80.293862
std    2020.870275     1.411874    13.153499      12.973563      12.746946
min       1.000000    17.000000    60.000000      60.000000      60.000000
25%    1750.750000    18.000000    70.000000      70.000000      70.000000
50%    3500.500000    19.000000    80.000000      80.000000      80.000000
75%    5250.250000    20.000000    91.000000      91.000000      90.000000
max    7000.000000    21.000000   150.000000     150.000000     149.000000

In [20]:
df

,Student ID,Gender,Age,School,Math Score,Reading Score,Writing Score,Class Performance
0,1,Male,18.0,C,99.0,94.0,98.0,C
1,2,Male,17.0,D,78.0,61.0,98.0,B
2,3,Female,21.0,B,67.0,95.0,78.0,A
3,4,Female,20.0,E,67.0,67.0,86.0,C
4,5,Female,20.0,B,66.0,81.0,74.0,B
...,...,...,...,...,...,...,...,...
6995,6996,Female,17.0,C,69.0,72.0,80.0,C
6996,6997,Female,21.0,E,70.0,79.0,100.0,C
6997,6998,Male,21.0,C,80.0,79.0,78.0,B
6998,6999,Male,20.0,A,74.0,80.0,68.0,A
6999,7000,Male,18.0,D,60.0,100.0,81.0,A

In [22]:
from sklearn.preprocessing import LabelEncoder

# Creating a LabelEncoder object
label_encoder = LabelEncoder()

# Encoding 'Gender' column
df['Gender'] = label_encoder.fit_transform(df['Gender'])

# Printing unique values after encoding
print(df['Gender'].unique())

[1 0]